## staging: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 15 to add, 10 to change, 12 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                          NAME                                                          |
|----------|------------------------------------------------------------------------------------------------------------------------|
| update   | `aws_kms_key.notification-canada-ca`                                                                                   |
|          | `module.notify_slack_critical.module.lambda.aws_iam_policy.additional_json[0]`                                         |
|          | `module.notify_slack_critical.module.lambda.aws_iam_role.lambda[0]`                                                    |
|          | `module.notify_slack_critical.module.lambda.aws_lambda_function.this[0]`                                               |
|          | `module.notify_slack_ok.module.lambda.aws_iam_policy.additional_json[0]`                                               |
|          | `module.notify_slack_ok.module.lambda.aws_iam_role.lambda[0]`                                                          |
|          | `module.notify_slack_ok.module.lambda.aws_lambda_function.this[0]`                                                     |
|          | `module.notify_slack_warning.module.lambda.aws_iam_policy.additional_json[0]`                                          |
|          | `module.notify_slack_warning.module.lambda.aws_iam_role.lambda[0]`                                                     |
|          | `module.notify_slack_warning.module.lambda.aws_lambda_function.this[0]`                                                |
| recreate | `module.notify_slack_critical.aws_sns_topic_subscription.sns_notify_slack[0]`                                          |
|          | `module.notify_slack_ok.aws_sns_topic_subscription.sns_notify_slack[0]`                                                |
|          | `module.notify_slack_warning.aws_sns_topic_subscription.sns_notify_slack[0]`                                           |
|          | `module.notify_slack_critical.module.lambda.aws_lambda_permission.current_version_triggers[&quot;AllowExecutionFromSNS&quot;]`   |
|          | `module.notify_slack_critical.module.lambda.aws_lambda_permission.unqualified_alias_triggers[&quot;AllowExecutionFromSNS&quot;]` |
|          | `module.notify_slack_critical.module.lambda.null_resource.archive[0]`                                                  |
|          | `module.notify_slack_ok.module.lambda.aws_lambda_permission.current_version_triggers[&quot;AllowExecutionFromSNS&quot;]`         |
|          | `module.notify_slack_ok.module.lambda.aws_lambda_permission.unqualified_alias_triggers[&quot;AllowExecutionFromSNS&quot;]`       |
|          | `module.notify_slack_ok.module.lambda.null_resource.archive[0]`                                                        |
|          | `module.notify_slack_warning.module.lambda.aws_lambda_permission.current_version_triggers[&quot;AllowExecutionFromSNS&quot;]`    |
|          | `module.notify_slack_warning.module.lambda.aws_lambda_permission.unqualified_alias_triggers[&quot;AllowExecutionFromSNS&quot;]`  |
|          | `module.notify_slack_warning.module.lambda.null_resource.archive[0]`                                                   |
| add      | `module.notify_slack_critical.module.lambda.local_file.archive_plan[0]`                                                |
|          | `module.notify_slack_ok.module.lambda.local_file.archive_plan[0]`                                                      |
|          | `module.notify_slack_warning.module.lambda.local_file.archive_plan[0]`                                                 |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/notification-terraform/actions/runs/16321742650).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
14:07:08.852 STDOUT terraform:   + create
14:07:08.852 STDOUT terraform:   ~ update in-place
14:07:08.852 STDOUT terraform: -/+ destroy and then create replacement
14:07:08.852 STDOUT terraform:  <= read (data resources)
14:07:08.852 STDOUT terraform: Terraform will perform the following actions:
14:07:08.852 STDOUT terraform:   # aws_kms_key.notification-canada-ca will be updated in-place
14:07:08.852 STDOUT terraform:   ~ resource "aws_kms_key" "notification-canada-ca" {
14:07:08.852 STDOUT terraform:       + bypass_policy_lockout_safety_check = false
14:07:08.853 STDOUT terraform:         id                                 = "a92df413-fc30-4f3e-8047-7433e1a8ad02"
14:07:08.853 STDOUT terraform:       ~ policy                             = jsonencode(
14:07:08.853 STDOUT terraform:           ~ {
14:07:08.853 STDOUT terraform:               ~ Statement = [
14:07:08.853 STDOUT terraform:                     # (1 unchanged element hidden)
14:07:08.853 STDOUT terraform:                     {
14:07:08.853 STDOUT terraform:                         Action    = [
14:07:08.853 STDOUT terraform:                             "kms:Encrypt*",
14:07:08.853 STDOUT terraform:                             "kms:Decrypt*",
14:07:08.853 STDOUT terraform:                             "kms:ReEncrypt*",
14:07:08.853 STDOUT terraform:                             "kms:GenerateDataKey*",
14:07:08.853 STDOUT terraform:                             "kms:Describe*",
14:07:08.853 STDOUT terraform:                         ]
14:07:08.853 STDOUT terraform:                         Effect    = "Allow"
14:07:08.853 STDOUT terraform:                         Principal = {
14:07:08.853 STDOUT terraform:                             Service = "logs.ca-central-1.amazonaws.com"
14:07:08.853 STDOUT terraform:                         }
14:07:08.853 STDOUT terraform:                         Resource  = "*"
14:07:08.853 STDOUT terraform:                     },
14:07:08.853 STDOUT terraform:                   ~ {
14:07:08.853 STDOUT terraform:                       ~ Principal = {
14:07:08.853 STDOUT terraform:                           ~ Service = "cloudwatch.amazonaws.com" -> [
14:07:08.853 STDOUT terraform:                               + "cloudwatch.amazonaws.com",
14:07:08.853 STDOUT terraform:                             ]
14:07:08.853 STDOUT terraform:                         }
14:07:08.853 STDOUT terraform:                         # (4 unchanged attributes hidden)
14:07:08.853 STDOUT terraform:                     },
14:07:08.853 STDOUT terraform:                     {
14:07:08.853 STDOUT terraform:                         Action    = [
14:07:08.853 STDOUT terraform:                             "kms:GenerateDataKey*",
14:07:08.853 STDOUT terraform:                             "kms:Decrypt",
14:07:08.853 STDOUT terraform:                         ]
14:07:08.853 STDOUT terraform:                         Effect    = "Allow"
14:07:08.853 STDOUT terraform:                         Principal = {
14:07:08.854 STDOUT terraform:                             Service = "ses.amazonaws.com"
14:07:08.854 STDOUT terraform:                         }
14:07:08.854 STDOUT terraform:                         Resource  = "*"
14:07:08.854 STDOUT terraform:                     },
14:07:08.854 STDOUT terraform:                   + {
14:07:08.854 STDOUT terraform:                       + Action    = [
14:07:08.854 STDOUT terraform:                           + "kms:GenerateDataKey*",
14:07:08.854 STDOUT terraform:                           + "kms:Decrypt",
14:07:08.854 STDOUT terraform:                         ]
14:07:08.854 STDOUT terraform:                       + Condition = {
14:07:08.854 STDOUT terraform:                           + ArnLike      = {
14:07:08.854 STDOUT terraform:                               + "aws:SourceArn" = "arn:aws:budgets::239043911459:*"
14:07:08.854 STDOUT terraform:                             }
14:07:08.854 STDOUT terraform:                           + StringEquals = {
14:07:08.854 STDOUT terraform:                               + "aws:SourceAccount" = "239043911459"
14:07:08.854 STDOUT terraform:                             }
14:07:08.854 STDOUT terraform:                         }
14:07:08.854 STDOUT terraform:                       + Effect    = "Allow"
14:07:08.854 STDOUT terraform:                       + Principal = {
14:07:08.854 STDOUT terraform:                           + Service = "budgets.amazonaws.com"
14:07:08.854 STDOUT terraform:                         }
14:07:08.854 STDOUT terraform:                       + Resource  = "*"
14:07:08.854 STDOUT terraform:                       + Sid       = "Allow_Budgets_for_CMK"
14:07:08.854 STDOUT terraform:                     },
14:07:08.854 STDOUT terraform:                 ]
14:07:08.854 STDOUT terraform:                 # (2 unchanged attributes hidden)
14:07:08.854 STDOUT terraform:             }
14:07:08.854 STDOUT terraform:         )
14:07:08.854 STDOUT terraform:         tags                               = {
14:07:08.854 STDOUT terraform:             "CostCenter" = "notification-canada-ca-staging"
14:07:08.854 STDOUT terraform:             "Name"       = "notification-canada-ca"
14:07:08.854 STDOUT terraform:         }
14:07:08.854 STDOUT terraform:         # (12 unchanged attributes hidden)
14:07:08.854 STDOUT terraform:     }
14:07:08.854 STDOUT terraform:   # module.notify_slack_critical.data.aws_caller_identity.current will be read during apply
14:07:08.855 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:07:08.855 STDOUT terraform:  <= data "aws_caller_identity" "current" {
14:07:08.855 STDOUT terraform:       + account_id = (known after apply)
14:07:08.855 STDOUT terraform:       + arn        = (known after apply)
14:07:08.855 STDOUT terraform:       + id         = (known after apply)
14:07:08.855 STDOUT terraform:       + user_id    = (known after apply)
14:07:08.855 STDOUT terraform:     }
14:07:08.855 STDOUT terraform:   # module.notify_slack_critical.data.aws_iam_policy_document.lambda[0] will be read during apply
14:07:08.855 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:07:08.855 STDOUT terraform:  <= data "aws_iam_policy_document" "lambda" {
14:07:08.855 STDOUT terraform:       + id            = (known after apply)
14:07:08.855 STDOUT terraform:       + json          = (known after apply)
14:07:08.855 STDOUT terraform:       + minified_json = (known after apply)
14:07:08.855 STDOUT terraform:       + statement {
14:07:08.855 STDOUT terraform:           + actions   = [
14:07:08.855 STDOUT terraform:               + "logs:CreateLogStream",
14:07:08.855 STDOUT terraform:               + "logs:PutLogEvents",
14:07:08.855 STDOUT terraform:             ]
14:07:08.855 STDOUT terraform:           + effect    = "Allow"
14:07:08.855 STDOUT terraform:           + resources = [
14:07:08.855 STDOUT terraform:               + "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/lambda/notify-slack-critical:*",
14:07:08.858 STDOUT terraform:             ]
14:07:08.858 STDOUT terraform:           + sid       = "AllowWriteToCloudwatchLogs"
14:07:08.858 STDOUT terraform:         }
14:07:08.858 STDOUT terraform:     }
14:07:08.858 STDOUT terraform:   # module.notify_slack_critical.data.aws_partition.current will be read during apply
14:07:08.858 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:07:08.858 STDOUT terraform:  <= data "aws_partition" "current" {
14:07:08.858 STDOUT terraform:       + dns_suffix         = (known after apply)
14:07:08.858 STDOUT terraform:       + id                 = (known after apply)
14:07:08.858 STDOUT terraform:       + partition          = (known after apply)
14:07:08.859 STDOUT terraform:       + reverse_dns_prefix = (known after apply)
14:07:08.859 STDOUT terraform:     }
14:07:08.859 STDOUT terraform:   # module.notify_slack_critical.data.aws_region.current will be read during apply
14:07:08.859 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:07:08.859 STDOUT terraform:  <= data "aws_region" "current" {
14:07:08.859 STDOUT terraform:       + description = (known after apply)
14:07:08.859 STDOUT terraform:       + endpoint    = (known after apply)
14:07:08.859 STDOUT terraform:       + id          = (known after apply)
14:07:08.859 STDOUT terraform:       + name        = (known after apply)
14:07:08.859 STDOUT terraform:     }
14:07:08.859 STDOUT terraform:   # module.notify_slack_critical.aws_sns_topic_subscription.sns_notify_slack[0] must be replaced
14:07:08.859 STDOUT terraform: -/+ resource "aws_sns_topic_subscription" "sns_notify_slack" {
14:07:08.859 STDOUT terraform:       ~ arn                             = "arn:aws:sns:ca-central-1:239043911459:alert-critical:1b57afd7-53e3-4593-8d86-d4a51ca90b6c" -> (known after apply)
14:07:08.859 STDOUT terraform:       ~ confirmation_was_authenticated  = true -> (known after apply)
14:07:08.859 STDOUT terraform:       + filter_policy_scope             = (known after apply)
14:07:08.859 STDOUT terraform:       ~ id                              = "arn:aws:sns:ca-central-1:239043911459:alert-critical:1b57afd7-53e3-4593-8d86-d4a51ca90b6c" -> (known after apply)
14:07:08.859 STDOUT terraform:       ~ owner_id                        = "239043911459" -> (known after apply)
14:07:08.859 STDOUT terraform:       ~ pending_confirmation            = false -> (known after apply)
14:07:08.859 STDOUT terraform:       ~ topic_arn                       = "arn:aws:sns:ca-central-1:239043911459:alert-critical" -> (known after apply) # forces replacement
14:07:08.860 STDOUT terraform:         # (10 unchanged attributes hidden)
14:07:08.860 STDOUT terraform:     }
14:07:08.860 STDOUT terraform:   # module.notify_slack_ok.data.aws_caller_identity.current will be read during apply
14:07:08.860 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:07:08.860 STDOUT terraform:  <= data "aws_caller_identity" "current" {
14:07:08.860 STDOUT terraform:       + account_id = (known after apply)
14:07:08.860 STDOUT terraform:       + arn        = (known after apply)
14:07:08.860 STDOUT terraform:       + id         = (known after apply)
14:07:08.860 STDOUT terraform:       + user_id    = (known after apply)
14:07:08.860 STDOUT terraform:     }
14:07:08.860 STDOUT terraform:   # module.notify_slack_ok.data.aws_iam_policy_document.lambda[0] will be read during apply
14:07:08.860 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:07:08.860 STDOUT terraform:  <= data "aws_iam_policy_document" "lambda" {
14:07:08.860 STDOUT terraform:       + id            = (known after apply)
14:07:08.860 STDOUT terraform:       + json          = (known after apply)
14:07:08.860 STDOUT terraform:       + minified_json = (known after apply)
14:07:08.860 STDOUT terraform:       + statement {
14:07:08.860 STDOUT terraform:           + actions   = [
14:07:08.860 STDOUT terraform:               + "logs:CreateLogStream",
14:07:08.860 STDOUT terraform:               + "logs:PutLogEvents",
14:07:08.860 STDOUT terraform:             ]
14:07:08.860 STDOUT terraform:           + effect    = "Allow"
14:07:08.860 STDOUT terraform:           + resources = [
14:07:08.860 STDOUT terraform:               + "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/lambda/notify-slack-ok:*",
14:07:08.860 STDOUT terraform:             ]
14:07:08.860 STDOUT terraform:           + sid       = "AllowWriteToCloudwatchLogs"
14:07:08.861 STDOUT terraform:         }
14:07:08.861 STDOUT terraform:     }
14:07:08.861 STDOUT terraform:   # module.notify_slack_ok.data.aws_partition.current will be read during apply
14:07:08.861 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:07:08.861 STDOUT terraform:  <= data "aws_partition" "current" {
14:07:08.861 STDOUT terraform:       + dns_suffix         = (known after apply)
14:07:08.861 STDOUT terraform:       + id                 = (known after apply)
14:07:08.861 STDOUT terraform:       + partition          = (known after apply)
14:07:08.861 STDOUT terraform:       + reverse_dns_prefix = (known after apply)
14:07:08.861 STDOUT terraform:     }
14:07:08.861 STDOUT terraform:   # module.notify_slack_ok.data.aws_region.current will be read during apply
14:07:08.861 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:07:08.861 STDOUT terraform:  <= data "aws_region" "current" {
14:07:08.861 STDOUT terraform:       + description = (known after apply)
14:07:08.861 STDOUT terraform:       + endpoint    = (known after apply)
14:07:08.861 STDOUT terraform:       + id          = (known after apply)
14:07:08.861 STDOUT terraform:       + name        = (known after apply)
14:07:08.864 STDOUT terraform:     }
14:07:08.864 STDOUT terraform:   # module.notify_slack_ok.aws_sns_topic_subscription.sns_notify_slack[0] must be replaced
14:07:08.864 STDOUT terraform: -/+ resource "aws_sns_topic_subscription" "sns_notify_slack" {
14:07:08.864 STDOUT terraform:       ~ arn                             = "arn:aws:sns:ca-central-1:239043911459:alert-ok:6d993a69-5b89-4871-b540-51f46e8c8d03" -> (known after apply)
14:07:08.864 STDOUT terraform:       ~ confirmation_was_authenticated  = true -> (known after apply)
14:07:08.864 STDOUT terraform:       + filter_policy_scope             = (known after apply)
14:07:08.864 STDOUT terraform:       ~ id                              = "arn:aws:sns:ca-central-1:239043911459:alert-ok:6d993a69-5b89-4871-b540-51f46e8c8d03" -> (known after apply)
14:07:08.865 STDOUT terraform:       ~ owner_id                        = "239043911459" -> (known after apply)
14:07:08.865 STDOUT terraform:       ~ pending_confirmation            = false -> (known after apply)
14:07:08.865 STDOUT terraform:       ~ topic_arn                       = "arn:aws:sns:ca-central-1:239043911459:alert-ok" -> (known after apply) # forces replacement
14:07:08.865 STDOUT terraform:         # (10 unchanged attributes hidden)
14:07:08.865 STDOUT terraform:     }
14:07:08.865 STDOUT terraform:   # module.notify_slack_warning.data.aws_caller_identity.current will be read during apply
14:07:08.865 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:07:08.865 STDOUT terraform:  <= data "aws_caller_identity" "current" {
14:07:08.865 STDOUT terraform:       + account_id = (known after apply)
14:07:08.865 STDOUT terraform:       + arn        = (known after apply)
14:07:08.865 STDOUT terraform:       + id         = (known after apply)
14:07:08.865 STDOUT terraform:       + user_id    = (known after apply)
14:07:08.865 STDOUT terraform:     }
14:07:08.865 STDOUT terraform:   # module.notify_slack_warning.data.aws_iam_policy_document.lambda[0] will be read during apply
14:07:08.865 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:07:08.865 STDOUT terraform:  <= data "aws_iam_policy_document" "lambda" {
14:07:08.865 STDOUT terraform:       + id            = (known after apply)
14:07:08.865 STDOUT terraform:       + json          = (known after apply)
14:07:08.865 STDOUT terraform:       + minified_json = (known after apply)
14:07:08.865 STDOUT terraform:       + statement {
14:07:08.865 STDOUT terraform:           + actions   = [
14:07:08.866 STDOUT terraform:               + "logs:CreateLogStream",
14:07:08.866 STDOUT terraform:               + "logs:PutLogEvents",
14:07:08.866 STDOUT terraform:             ]
14:07:08.866 STDOUT terraform:           + effect    = "Allow"
14:07:08.866 STDOUT terraform:           + resources = [
14:07:08.866 STDOUT terraform:               + "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/lambda/notify-slack-warning:*",
14:07:08.866 STDOUT terraform:             ]
14:07:08.866 STDOUT terraform:           + sid       = "AllowWriteToCloudwatchLogs"
14:07:08.866 STDOUT terraform:         }
14:07:08.866 STDOUT terraform:     }
14:07:08.866 STDOUT terraform:   # module.notify_slack_warning.data.aws_partition.current will be read during apply
14:07:08.866 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:07:08.866 STDOUT terraform:  <= data "aws_partition" "current" {
14:07:08.866 STDOUT terraform:       + dns_suffix         = (known after apply)
14:07:08.866 STDOUT terraform:       + id                 = (known after apply)
14:07:08.866 STDOUT terraform:       + partition          = (known after apply)
14:07:08.866 STDOUT terraform:       + reverse_dns_prefix = (known after apply)
14:07:08.866 STDOUT terraform:     }
14:07:08.866 STDOUT terraform:   # module.notify_slack_warning.data.aws_region.current will be read during apply
14:07:08.866 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:07:08.866 STDOUT terraform:  <= data "aws_region" "current" {
14:07:08.866 STDOUT terraform:       + description = (known after apply)
14:07:08.866 STDOUT terraform:       + endpoint    = (known after apply)
14:07:08.866 STDOUT terraform:       + id          = (known after apply)
14:07:08.866 STDOUT terraform:       + name        = (known after apply)
14:07:08.866 STDOUT terraform:     }
14:07:08.867 STDOUT terraform:   # module.notify_slack_warning.aws_sns_topic_subscription.sns_notify_slack[0] must be replaced
14:07:08.867 STDOUT terraform: -/+ resource "aws_sns_topic_subscription" "sns_notify_slack" {
14:07:08.867 STDOUT terraform:       ~ arn                             = "arn:aws:sns:ca-central-1:239043911459:alert-warning:2a65e7dc-9cb9-4bff-b209-f28dd0f23fb4" -> (known after apply)
14:07:08.867 STDOUT terraform:       ~ confirmation_was_authenticated  = true -> (known after apply)
14:07:08.867 STDOUT terraform:       + filter_policy_scope             = (known after apply)
14:07:08.867 STDOUT terraform:       ~ id                              = "arn:aws:sns:ca-central-1:239043911459:alert-warning:2a65e7dc-9cb9-4bff-b209-f28dd0f23fb4" -> (known after apply)
14:07:08.867 STDOUT terraform:       ~ owner_id                        = "239043911459" -> (known after apply)
14:07:08.867 STDOUT terraform:       ~ pending_confirmation            = false -> (known after apply)
14:07:08.868 STDOUT terraform:       ~ topic_arn                       = "arn:aws:sns:ca-central-1:239043911459:alert-warning" -> (known after apply) # forces replacement
14:07:08.868 STDOUT terraform:         # (10 unchanged attributes hidden)
14:07:08.868 STDOUT terraform:     }
14:07:08.868 STDOUT terraform:   # module.notify_slack_critical.module.lambda.data.aws_caller_identity.current will be read during apply
14:07:08.868 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:07:08.869 STDOUT terraform:  <= data "aws_caller_identity" "current" {
14:07:08.869 STDOUT terraform:       + account_id = (known after apply)
14:07:08.869 STDOUT terraform:       + arn        = (known after apply)
14:07:08.869 STDOUT terraform:       + id         = (known after apply)
14:07:08.869 STDOUT terraform:       + user_id    = (known after apply)
14:07:08.869 STDOUT terraform:     }
14:07:08.869 STDOUT terraform:   # module.notify_slack_critical.module.lambda.data.aws_cloudwatch_log_group.lambda[0] will be read during apply
14:07:08.869 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:07:08.869 STDOUT terraform:  <= data "aws_cloudwatch_log_group" "lambda" {
14:07:08.869 STDOUT terraform:       + arn               = (known after apply)
14:07:08.869 STDOUT terraform:       + creation_time     = (known after apply)
14:07:08.869 STDOUT terraform:       + id                = (known after apply)
14:07:08.869 STDOUT terraform:       + kms_key_id        = (known after apply)
14:07:08.869 STDOUT terraform:       + log_group_class   = (known after apply)
14:07:08.869 STDOUT terraform:       + name              = "/aws/lambda/notify-slack-critical"
14:07:08.869 STDOUT terraform:       + retention_in_days = (known after apply)
14:07:08.869 STDOUT terraform:       + tags              = (known after apply)
14:07:08.869 STDOUT terraform:     }
14:07:08.869 STDOUT terraform:   # module.notify_slack_critical.module.lambda.data.aws_iam_policy_document.assume_role[0] will be read during apply
14:07:08.869 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:07:08.869 STDOUT terraform:  <= data "aws_iam_policy_document" "assume_role" {
14:07:08.869 STDOUT terraform:       + id            = (known after apply)
14:07:08.869 STDOUT terraform:       + json          = (known after apply)
14:07:08.869 STDOUT terraform:       + minified_json = (known after apply)
14:07:08.869 STDOUT terraform:       + statement {
14:07:08.869 STDOUT terraform:           + actions = [
14:07:08.869 STDOUT terraform:               + "sts:AssumeRole",
14:07:08.869 STDOUT terraform:             ]
14:07:08.869 STDOUT terraform:           + effect  = "Allow"
14:07:08.869 STDOUT terraform:           + principals {
14:07:08.869 STDOUT terraform:               + identifiers = [
14:07:08.869 STDOUT terraform:                   + "lambda.amazonaws.com",
14:07:08.869 STDOUT terraform:                 ]
14:07:08.869 STDOUT terraform:               + type        = "Service"
14:07:08.869 STDOUT terraform:             }
14:07:08.869 STDOUT terraform:         }
14:07:08.869 STDOUT terraform:     }
14:07:08.869 STDOUT terraform:   # module.notify_slack_critical.module.lambda.data.aws_partition.current will be read during apply
14:07:08.870 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:07:08.870 STDOUT terraform:  <= data "aws_partition" "current" {
14:07:08.870 STDOUT terraform:       + dns_suffix         = (known after apply)
14:07:08.870 STDOUT terraform:       + id                 = (known after apply)
14:07:08.870 STDOUT terraform:       + partition          = (known after apply)
14:07:08.870 STDOUT terraform:       + reverse_dns_prefix = (known after apply)
14:07:08.870 STDOUT terraform:     }
14:07:08.870 STDOUT terraform:   # module.notify_slack_critical.module.lambda.data.aws_region.current will be read during apply
14:07:08.870 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:07:08.870 STDOUT terraform:  <= data "aws_region" "current" {
14:07:08.870 STDOUT terraform:       + description = (known after apply)
14:07:08.870 STDOUT terraform:       + endpoint    = (known after apply)
14:07:08.870 STDOUT terraform:       + id          = (known after apply)
14:07:08.870 STDOUT terraform:       + name        = (known after apply)
14:07:08.870 STDOUT terraform:     }
14:07:08.870 STDOUT terraform:   # module.notify_slack_critical.module.lambda.data.external.archive_prepare[0] will be read during apply
14:07:08.870 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:07:08.870 STDOUT terraform:  <= data "external" "archive_prepare" {
14:07:08.870 STDOUT terraform:       + id      = (known after apply)
14:07:08.870 STDOUT terraform:       + program = [
14:07:08.870 STDOUT terraform:           + "python3",
14:07:08.870 STDOUT terraform:           + ".terraform/modules/notify_slack_critical.lambda/package.py",
14:07:08.870 STDOUT terraform:           + "prepare",
14:07:08.870 STDOUT terraform:         ]
14:07:08.870 STDOUT terraform:       + query   = {
14:07:08.870 STDOUT terraform:           + "artifacts_dir"            = "builds"
14:07:08.870 STDOUT terraform:           + "docker"                   = null
14:07:08.870 STDOUT terraform:           + "hash_extra"               = null
14:07:08.870 STDOUT terraform:           + "hash_extra_paths"         = jsonencode([])
14:07:08.870 STDOUT terraform:           + "paths"                    = jsonencode(
14:07:08.870 STDOUT terraform:                 {
14:07:08.870 STDOUT terraform:                   + cwd    = "./.terragrunt-cache/vSsGrkoVpAumzVObg4Ds4hDC_7Y/ziUKr5pa_JoeDZ3wgSbieuIpHJE/common"
14:07:08.870 STDOUT terraform:                   + module = ".terraform/modules/notify_slack_critical.lambda"
14:07:08.870 STDOUT terraform:                   + root   = "."
14:07:08.870 STDOUT terraform:                 }
14:07:08.870 STDOUT terraform:             )
14:07:08.870 STDOUT terraform:           + "recreate_missing_package" = "true"
14:07:08.870 STDOUT terraform:           + "runtime"                  = "python3.11"
14:07:08.870 STDOUT terraform:           + "source_path"              = "\".terraform/modules/notify_slack_critical/functions/notify_slack.py\""
14:07:08.870 STDOUT terraform:         }
14:07:08.870 STDOUT terraform:       + result  = (known after apply)
14:07:08.871 STDOUT terraform:     }
14:07:08.871 STDOUT terraform:   # module.notify_slack_critical.module.lambda.aws_iam_policy.additional_json[0] will be updated in-place
14:07:08.871 STDOUT terraform:   ~ resource "aws_iam_policy" "additional_json" {
14:07:08.871 STDOUT terraform:         id               = "arn:aws:iam::239043911459:policy/lambda-notify-slack-critical"
14:07:08.871 STDOUT terraform:         name             = "lambda-notify-slack-critical"
14:07:08.871 STDOUT terraform:       ~ policy           = jsonencode(
14:07:08.871 STDOUT terraform:             {
14:07:08.871 STDOUT terraform:               - Statement = [
14:07:08.871 STDOUT terraform:                   - {
14:07:08.871 STDOUT terraform:                       - Action   = [
14:07:08.871 STDOUT terraform:                           - "logs:PutLogEvents",
14:07:08.871 STDOUT terraform:                           - "logs:CreateLogStream",
14:07:08.871 STDOUT terraform:                         ]
14:07:08.871 STDOUT terraform:                       - Effect   = "Allow"
14:07:08.871 STDOUT terraform:                       - Resource = "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/lambda/notify-slack-critical:*"
14:07:08.871 STDOUT terraform:                       - Sid      = "AllowWriteToCloudwatchLogs"
14:07:08.871 STDOUT terraform:                     },
14:07:08.871 STDOUT terraform:                 ]
14:07:08.871 STDOUT terraform:               - Version   = "2012-10-17"
14:07:08.871 STDOUT terraform:             }
14:07:08.871 STDOUT terraform:         ) -> (known after apply)
14:07:08.871 STDOUT terraform:         tags             = {}
14:07:08.871 STDOUT terraform:         # (7 unchanged attributes hidden)
14:07:08.871 STDOUT terraform:     }
14:07:08.871 STDOUT terraform:   # module.notify_slack_critical.module.lambda.aws_iam_role.lambda[0] will be updated in-place
14:07:08.871 STDOUT terraform:   ~ resource "aws_iam_role" "lambda" {
14:07:08.871 STDOUT terraform:       ~ assume_role_policy    = jsonencode(
14:07:08.871 STDOUT terraform:             {
14:07:08.871 STDOUT terraform:               - Statement = [
14:07:08.871 STDOUT terraform:                   - {
14:07:08.872 STDOUT terraform:                       - Action    = "sts:AssumeRole"
14:07:08.872 STDOUT terraform:                       - Effect    = "Allow"
14:07:08.872 STDOUT terraform:                       - Principal = {
14:07:08.872 STDOUT terraform:                           - Service = "lambda.amazonaws.com"
14:07:08.872 STDOUT terraform:                         }
14:07:08.872 STDOUT terraform:                       - Sid       = ""
14:07:08.872 STDOUT terraform:                     },
14:07:08.872 STDOUT terraform:                 ]
14:07:08.872 STDOUT terraform:               - Version   = "2012-10-17"
14:07:08.872 STDOUT terraform:             }
14:07:08.872 STDOUT terraform:         ) -> (known after apply)
14:07:08.872 STDOUT terraform:         id                    = "lambda-notify-slack-critical"
14:07:08.872 STDOUT terraform:         name                  = "lambda-notify-slack-critical"
14:07:08.872 STDOUT terraform:         tags                  = {}
14:07:08.872 STDOUT terraform:         # (11 unchanged attributes hidden)
14:07:08.872 STDOUT terraform:         # (1 unchanged block hidden)
14:07:08.872 STDOUT terraform:     }
14:07:08.872 STDOUT terraform:   # module.notify_slack_critical.module.lambda.aws_lambda_function.this[0] will be updated in-place
14:07:08.872 STDOUT terraform:   ~ resource "aws_lambda_function" "this" {
14:07:08.872 STDOUT terraform:       ~ filename                       = "builds/1e622be40890679d302c03a6096c334d64151aab5aee3e073035598ee5e01db2.zip" -> (known after apply)
14:07:08.872 STDOUT terraform:         id                             = "notify-slack-critical"
14:07:08.872 STDOUT terraform:       ~ last_modified                  = "2025-01-28T16:41:16.000+0000" -> (known after apply)
14:07:08.872 STDOUT terraform:       ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-critical:12" -> (known after apply)
14:07:08.872 STDOUT terraform:       ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-critical:12/invocations" -> (known after apply)
14:07:08.873 STDOUT terraform:       ~ source_code_hash               = "m+3aOTZ7CcLALkOHo1if48aL7NEGhYZr44iJ+ZpR/t8=" -> (known after apply)
14:07:08.873 STDOUT terraform:         tags                           = {}
14:07:08.873 STDOUT terraform:       ~ version                        = "12" -> (known after apply)
14:07:08.873 STDOUT terraform:         # (23 unchanged attributes hidden)
14:07:08.873 STDOUT terraform:         # (4 unchanged blocks hidden)
14:07:08.873 STDOUT terraform:     }
14:07:08.873 STDOUT terraform:   # module.notify_slack_critical.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] must be replaced
14:07:08.873 STDOUT terraform: -/+ resource "aws_lambda_permission" "current_version_triggers" {
14:07:08.873 STDOUT terraform:       ~ id                  = "AllowExecutionFromSNS" -> (known after...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.ad_hoc"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.build_tables"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.support"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.cloudwatch_data_scanned"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.notify_global"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical[0]"]
WARN - plan.json - main - Missing Common...
```

</details>
